Repository: meerk40t/meerk40t
Catalog: locale/*/messages.po
Languages: pl_pl

source: This is a test string.
pl_pl: To jest ciąg testowy.

source: Another test string with a newline. See?
pl_pl: Kolejny ciąg testowy z nową linią. Widzisz?

source: String with a tab. See?
pl_pl: Ciąg z tabulatorem. Widzisz?

source: String with {curly} braces.
pl_pl: Ciąg z klamrami {curly}.

source: String with a quote: "See?"
pl_pl: Ciąg z cytatem: "Widzisz?"

source: Label
pl_pl: Etykieta

source: What is this device called.
pl_pl: Jak nazywa się to urządzenie.

source: General
pl_pl: Ogólne

source: Laser Source
pl_pl: Źródło lasera

source: What type of laser is this?
pl_pl: Jakiego typu jest to laser?

source: Enable
pl_pl: Włącz

source: Use correction file?
pl_pl: Użyć pliku korekcyjnego?

source: Correction File
pl_pl: Plik korekcyjny

source: File
pl_pl: Plik

source: Provide a correction file for the machine
pl_pl: Podaj plik korekcyjny dla maszyny

source: Width
pl_pl: Szerokość

source: Lens Size
pl_pl: Rozmiar soczewki

source: Laserspot
pl_pl: Plamka lasera

source: Laser spot size
pl_pl: Rozmiar plamki lasera

source: Flip X
pl_pl: Odbicie X

source: Flip the X axis for the device
pl_pl: Odbij oś X dla urządzenia

source: Parameters
pl_pl: Parametry

source: Axis corrections
pl_pl: Korekty osi

source: Flip Y
pl_pl: Odbicie Y

source: Flip the Y axis for the device
pl_pl: Odbij oś Y dla urządzenia

source: Swap XY
pl_pl: Zamień XY

source: Swap the X and Y axis for the device
pl_pl: Zamień osie X i Y dla urządzenia

source: Rotate View
pl_pl: Obróć widok

source: Rotate the device field
pl_pl: Obróć pole urządzenia

source: X-Margin
pl_pl: Margines X

source: Margin for the X-axis. This will be a kind of unused space at the left side.
pl_pl: Margines dla osi X. Będzie to rodzaj nieużywanej przestrzeni po lewej stronie.

source: User Offset
pl_pl: Przesunięcie użytkownika

source: Y-Margin
pl_pl: Margines Y

source: Margin for the Y-axis. This will be a kind of unused space at the top.
pl_pl: Margines dla osi Y. Będzie to rodzaj nieużywanej przestrzeni u góry.

source: Curve Interpolation
pl_pl: Interpolacja krzywych

source: Number of curve interpolation points
pl_pl: Liczba punktów interpolacji krzywych

source: Run mock-usb backend
pl_pl: Uruchom backend mock-usb

source: This starts connects to fake software laser rather than real one for debugging.
pl_pl: To uruchamia połączenie z fałszywym oprogramowaniem lasera zamiast z prawdziwym, w celu debugowania.

source: Machine index to select
pl_pl: Indeks maszyny do wyboru

source: Which machine should we connect to? -- Leave at 0 if you have 1 machine.
pl_pl: Z którą maszyną mamy się połączyć? -- Zostaw 0, jeśli masz 1 maszynę.

source: Device Selection
pl_pl: Wybór urządzenia

source: Check serial no
pl_pl: Sprawdź numer seryjny

source: Does the machine need to have a specific serial number?
pl_pl: Czy maszyna musi mieć określony numer seryjny?

source: Footpedal
pl_pl: Pedał nożny

source: What pin is your foot pedal hooked to on the GPIO
pl_pl: Do którego pinu podłączony jest pedał nożny w GPIO

source: Pin-Index
pl_pl: Indeks pinu

source: Redlight laser
pl_pl: Laser światła czerwonego

source: What pin is your redlight hooked to on the GPIO
pl_pl: Do którego pinu podłączone jest światło czerwone w GPIO

source: Device Position
pl_pl: Pozycja urządzenia

source: Do you want to see some indicator about the current device position?
pl_pl: Czy chcesz widzieć wskaźnik aktualnej pozycji urządzenia?

source: Screen updates
pl_pl: Aktualizacje ekranu

source: Coolant
pl_pl: Chłodziwo

source: Does this device has a method to turn on / off a coolant associated to it?
pl_pl: Czy to urządzenie posiada metodę włączania / wyłączania przypisanego do niego chłodziwa?

source: Coolant Support
pl_pl: Obsługa chłodziwa

source: Redlight travel speed
pl_pl: Prędkość ruchu światła czerwonego

source: Speed of the galvo when using the red laser.
pl_pl: Prędkość galvo podczas używania czerwonego lasera.

source: Dark
pl_pl: Ciemny

source: Delay for dark movement.
pl_pl: Opóźnienie dla ruchu bez lasera (dark).

source: Delays
pl_pl: Opóźnienia

source: Light
pl_pl: Jasny

source: Delay for light movement.
pl_pl: Opóźnienie dla ruchu z laserem (light).

source: X-Offset
pl_pl: Przesunięcie X

source: Offset the redlight positions by this amount in x
pl_pl: Przesuń pozycje światła czerwonego o tę wartość w osi x

source: Redlight-Offset
pl_pl: Przesunięcie światła czerwonego

source: Y-Offset
pl_pl: Przesunięcie Y

source: Offset the redlight positions by this amount in y
pl_pl: Przesuń pozycje światła czerwonego o tę wartość w osi y

source: Angle Offset
pl_pl: Przesunięcie kątowe

source: Offset the redlight positions by this angle, curving around center
pl_pl: Przesuń pozycje światła czerwonego o ten kąt, zakrzywiając wokół środka

source: Prefer redlight on
pl_pl: Preferuj włączone światło czerwone

source: Redlight preference will turn toggleable redlights on after a job completes.
pl_pl: Preferencja światła czerwonego spowoduje włączenie przełączalnych świateł czerwonych po zakończeniu zadania.

source: Power
pl_pl: Moc

source: Cut/Engrave
pl_pl: Cięcie/Grawerowanie

source: What power level do we cut at?
pl_pl: Z jaką mocą tniemy?

source: This is global setting that will be overruled by operation settings.
pl_pl: Jest to ustawienie globalne, które zostanie nadpisane przez ustawienia operacji.

source: How fast do we cut?
pl_pl: Jak szybko tniemy?

source: Q Switch Frequency
pl_pl: Częstotliwość przełącznika Q

source: Could not contact Galvo laser.
pl_pl: Nie można skontaktować się z laserem Galvo.

source: Resume the currently running job
pl_pl: Wznów aktualnie uruchomione zadanie

source: override one second laser fire pulse duration
pl_pl: nadpisz jednosekundowy czas trwania impulsu lasera

source: Power level
pl_pl: Poziom mocy

source: laser fire pulse duration
pl_pl: czas trwania impulsu ognia lasera

source: Pulse the laser in place.
pl_pl: Impuls lasera w miejscu.

source: Opens device-specific configuration window
pl_pl: Otwiera okno konfiguracji specyficznej dla urządzenia

source: Galvo Light
pl_pl: Światło Galvo

source: Runs outline on selection
pl_pl: Uruchamia obrys na zaznaczeniu

source: Cameras found: {count}
pl_pl: Znaleziono kamery: {count}

source: Looking for Cameras (Range={max_range})
pl_pl: Szukanie kamer (Zakres={max_range})

source: Display the camera window
pl_pl: Wyświetl okno kamery

source: Add URI
pl_pl: Dodaj URI

source: Displays
pl_pl: Wyświetlacze

source: ensure that one piece is finished before starting on another.
pl_pl: upewnij się, że jeden element jest ukończony przed rozpoczęciem kolejnego.

source: This optimization works best with Merge Operations also checked though this is not a requirement.
pl_pl: Ta optymalizacja działa najlepiej przy zaznaczonej opcji Scal Operacje, choć nie jest to wymagane.

source: Because this optimisation is done once rasters have been turned into images, inner elements may span multiple design pieces, in which case they may be optimised together.
pl_pl: Ponieważ ta optymalizacja jest wykonywana po zamianie rastrów na obrazy, elementy wewnętrzne mogą obejmować wiele części projektu, w którym to przypadku mogą być optymalizowane wspólnie.

source: Closed Distance
pl_pl: Odległość zamknięcia

source: How close in device specific natural units do endpoints need to be to count as closed?
pl_pl: Jak blisko w jednostkach naturalnych specyficznych dla urządzenia muszą znajdować się punkty końcowe, aby uznać je za zamknięte?

source: Keep effect lines together
pl_pl: Trzymaj linie efektów razem

source: Active: effects like hatches are dealt with as a bigger shape
pl_pl: Aktywne: efekty takie jak kreskowanie są traktowane jako większy kształt

source: Inactive: every single line segment will be dealt with individually.
pl_pl: Nieaktywne: każdy segment linii będzie traktowany indywidualnie.

source: Optimize internally
pl_pl: Optymalizuj wewnętrznie

source: Active: hatch lines will be optimized internally
pl_pl: Aktywne: linie kreskowania będą optymalizowane wewnętrznie

source: Inactive: hatch lines will be burnt sequentially.
pl_pl: Nieaktywne: linie kreskowania będą wypalane sekwencyjnie.

source: Reduce polyline details
pl_pl: Zredukuj szczegóły polilinii

source: Active: reduce the details of polyline elements, so that less information needs to be sent to the laser.
pl_pl: Aktywne: zredukuj szczegóły elementów polilinii, aby do lasera przesyłanych było mniej informacji.

source: This can reduce the processing and laser time but can as well compromise the quality at higher levels, so use with care and preview in simulation.
pl_pl: Może to skrócić czas przetwarzania i pracy lasera, ale może również pogorszyć jakość na wyższych poziomach, więc używaj ostrożnie i sprawdzaj podgląd w symulacji.

source: Details
pl_pl: Szczegóły

source: Level
pl_pl: Poziom

source: Minimal
pl_pl: Minimalny

source: Unticked: A drag operation of regmark nodes to an operation will be ignored.
pl_pl: Niezaznaczone: Operacja przeciągania węzłów punktów orientacyjnych do operacji zostanie zignorowana.

source: Behaviour
pl_pl: Zachowanie

source: Reuse existing
pl_pl: Użyj ponownie istniejących

source: Ticked: When loading a file we will reuse an existing operation with the same principal properties.
pl_pl: Zaznaczone: Podczas ładowania pliku użyjemy ponownie istniejącej operacji o tych samych głównych właściwościach.

source: Unticked: We will add another operation alongside existing ones (always the case if properties differ).
pl_pl: Niezaznaczone: Dodamy kolejną operację obok istniejących (zawsze w przypadku różnicy właściwości).

source: Loading
pl_pl: Ładowanie

source: Statusbar display
pl_pl: Wyświetlanie paska stanu

source: As in operations tree
pl_pl: Jak w drzewie operacji

source: Group types together (CC EE RR II)
pl_pl: Grupuj typy razem (CC EE RR II)

source: Matching (CERI CERI)
pl_pl: Dopasowanie (CERI CERI)

source: Choose if and how you want to group together / display the default operations at the bottom of the screen
pl_pl: Wybierz czy i jak chcesz grupować / wyświetlać domyślne operacje na dole ekranu

source: Default Operations
pl_pl: Domyślne operacje

source: Autogenerate both for fill and stroke
pl_pl: Automatycznie generuj zarówno dla wypełnienia, jak i obrysu

source: Active: for both stroke and fill we look for a corresponding hit, if none was found we generate a matching operation
pl_pl: Aktywne: zarówno dla obrysu, jak i wypełnienia szukamy pasującego elementu, jeśli nie zostanie znaleziony, generujemy pasującą operację

source: Inactive: one hit of either stroke or fill is enough to prevent autogeneration
pl_pl: Nieaktywne: jedno trafienie obrysu lub wypełnienia wystarczy, aby zapobiec automatycznemu generowaniu

source: Copy will increase {variable} references
pl_pl: Kopiowanie zwiększy referencje {variable}

source: Active: if you copy a text-element containing a wordlist-reference, this will be increased (effectively referencing the next entry in the wordlist)
pl_pl: Aktywne: jeśli skopiujesz element tekstowy zawierający referencję do listy słów, zostanie ona zwiększona (skutecznie odwołując się do następnego wpisu na liście)

source: Wordlist
pl_pl: Lista słów

source: File startup commands
pl_pl: Polecenia startowe pliku

source: Ignore
pl_pl: Ignoruj

source: Ask
pl_pl: Pytaj

source: Allow
pl_pl: Zezwalaj

source: Choose if file startup commands are allowed in principle or will all be ignored.
pl_pl: Wybierz, czy polecenia startowe pliku są dopuszczalne z zasady, czy wszystkie będą ignorowane.

source: Note: They still need to be activated on a per file basis.
pl_pl: Uwaga: Nadal muszą zostać aktywowane dla każdego pliku z osobna.

source: File is Malformed
pl_pl: Plik jest uszkodzony

source: Cut ({percent}, {speed}mm/s)
pl_pl: Cięcie ({percent}, {speed}mm/s)

source: Engrave ({percent}, {speed}mm/s)
pl_pl: Grawerowanie ({percent}, {speed}mm/s)

source: Image ({percent}, {speed}mm/s)
pl_pl: Obraz ({percent}, {speed}mm/s)

source: Load operations
pl_pl: Ładuj operacje

source: Default operations for {dev}
pl_pl: Domyślne operacje dla {dev}

source: Default operations
pl_pl: Domyślne operacje

source: Element altered
pl_pl: Element zmieniony

source: Element modified
pl_pl: Element zmodyfikowany

source: Element shifted
pl_pl: Element przesunięty

source: Element scaled
pl_pl: Element przeskalowany

source: Element added
pl_pl: Element dodany

source: Element deleted
pl_pl: Element usunięty

source: set text anchor
pl_pl: ustaw zakotwiczenie tekstu

source: set text object text-anchor; start, middle, end
pl_pl: ustaw zakotwiczenie obiektu tekstowego; początek, środek, koniec

source: resize: nothing selected
pl_pl: zmiana rozmiaru: nic nie zaznaczono

source: resize: cannot resize a dot
pl_pl: zmiana rozmiaru: nie można zmienić rozmiaru kropki

source: Invalid width/height
pl_pl: Nieprawidłowa szerokość/wysokość

source: skew_x value
pl_pl: wartość skew_x

source: Elements (Effects)
pl_pl: Elementy (Efekty)

source: Placements
pl_pl: Rozmieszczenia

source: Do yo want to use a bespoke formatter?
pl_pl: Czy chcesz użyć niestandardowego formatera?

source: Bespoke formatter for this node-type
pl_pl: Niestandardowy formater dla tego typu węzła

source: Enable/Disable the warning level
pl_pl: Włącz/Wyłącz poziom ostrzegania

source: Warn level for minimum {unit}
pl_pl: Poziom ostrzegania dla minimum {unit}

source: Just for info: we have missed a couple of vertices...
pl_pl: Tylko informacyjnie: pominęliśmy kilka wierzchołków...

source: To hit all, the density parameters should be e.g. {combinations}
pl_pl: Aby trafić we wszystkie, parametry gęstości powinny wynosić np. {combinations}

source: Create shape
pl_pl: Utwórz kształt

source: Z-Homing...
pl_pl: Bazowanie Z...

source: Amount to move the z-axis
pl_pl: Wartość przesunięcia osi z

source: GRBL-Configuration
pl_pl: Konfiguracja GRBL

source: Query properties
pl_pl: Zapytaj o właściwości

source: * The countless developers who created other software that we use internally.
pl_pl: * Niezliczeni programiści, którzy stworzyli inne oprogramowanie, którego używamy wewnętrznie.

source: * Regebro for his svg.path module which inspired svgelements.
pl_pl: * Regebro za moduł svg.path, który zainspirował svgelements.

source: Execute the commands
pl_pl: Wykonaj polecenia

source: Click to get a list of useful commands
pl_pl: Kliknij, aby uzyskać listę przydatnych poleceń

source: Clear console
pl_pl: Wyczyść konsolę

source: Start simulation
pl_pl: Uruchom symulację

source: Burn content on current device
pl_pl: Wypal zawartość na bieżącym urządzeniu

source: Activate {info}
pl_pl: Aktywuj {info}

source: Edit commands to be executed on file load
pl_pl: Edytuj polecenia do wykonania przy ładowaniu pliku

source: Leave color
pl_pl: Pozostaw kolor

source: Op inherits color
pl_pl: Operacja dziedziczy kolor

source: Elem inherits color
pl_pl: Element dziedziczy kolor

source: Exclusive
pl_pl: Ekskluzywny

source: Similar
pl_pl: Podobny

source: Leave - neither the color of the operation nor...
pl_pl: Pozostaw - ani kolor operacji ani...

source: cause damage to your laser tube!
pl_pl: spowodować uszkodzenie rury lasera!

source: Resume
pl_pl: Wznów

source: Disarm
pl_pl: Rozbrój

source: Prevent the laser from accidentally executing
pl_pl: Zapobiegaj przypadkowemu uruchomieniu lasera

source: Enable Arm Requirement
pl_pl: Włącz wymóg uzbrojenia

source: Enable Arm
pl_pl: Włącz uzbrojenie

source: Disable Arm Requirement
pl_pl: Wyłącz wymóg uzbrojenia

source: Disable Arm
pl_pl: Wyłącz uzbrojenie

source: We intentionally ignored a request to start a job via the keyboard. You need to make your intent clear by a deliberate mouse-click
pl_pl: Celowo zignorowaliśmy żądanie rozpoczęcia zadania za pomocą klawiatury. Musisz wyrazić swój zamiar poprzez celowe kliknięcie myszką

source: Preparing Laserjob...
pl_pl: Przygotowywanie zadania lasera...

source: Speed
pl_pl: Prędkość

source: Select the values you want to test for {param}
pl_pl: Wybierz wartości, które chcesz przetestować dla {param}

source: Move laser in the left direction
pl_pl: Przesuń laser w lewo

source: Translate Y - moves the element by this amount of mils in the Y-direction; you may use 'real' distances when modifying this factor, i.e. 2in, 3cm, 50mm
pl_pl: Przesunięcie Y - przesuwa element o tę wartość w milach w kierunku Y; możesz używać 'rzeczywistych' odległości przy modyfikacji tego współczynnika, np. 2in, 3cm, 50mm

source: Skew
pl_pl: Pochylenie

source: Translate
pl_pl: Przesunięcie

source: Space
pl_pl: Przestrzeń

source: Preferences
pl_pl: Preferencje

source: Opens Preferences Window
pl_pl: Otwiera okno preferencji

source: Pr&eferences... Ctrl-,
pl_pl: Pr&eferencje... Ctrl-,

source: the cursor snap to the next grid intersection?
pl_pl: przyciąganie kursora do najbliższego przecięcia siatki?

source: Set the screen distance in pixels inside which the cursor will snap to the nearest grid intersection
pl_pl: Ustaw odległość ekranową w pikselach, wewnątrz której kursor będzie przyciągany do najbliższego przecięcia siatki

source: Overall visibility
pl_pl: Ogólna widoczność

source: Distance
pl_pl: Odległość

source: Current Value: {value} pixel
pl_pl: Aktualna wartość: {value} pikseli

source: Opens the spooler window with all job information
pl_pl: Otwiera okno spoolera ze wszystkimi informacjami o zadaniach

source: -- All available devices --
pl_pl: -- Wszystkie dostępne urządzenia --

source: Process input while moving slider handle
pl_pl: Przetwarzaj dane wejściowe podczas przesuwania uchwytu suwaka

source: Try to immediately use values while you drag a slider -
pl_pl: Próbuj natychmiast używać wartości podczas przeciągania suwaka -

source: otherwise they will get applied only after you release the mouse button.
pl_pl: w przeciwnym razie zostaną one zastosowane dopiero po zwolnieniu przycisku myszy.

source: NB: This applies only for time-consuming updates
pl_pl: Uwaga: Dotyczy to tylko czasochłonnych aktualizacji

source: Wrap the current node in a hatch
pl_pl: Otocz bieżący węzeł kreskowaniem

source: Wrap the current node in a hatch (bidirectional)
pl_pl: Otocz bieżący węzeł kreskowaniem (dwukierunkowym)

source: Fill (unidirectional)
pl_pl: Wypełnienie (jednokierunkowe)

source: Fill (bidirectional)
pl_pl: Wypełnienie (dwukierunkowe)

source: Simple line hatch
pl_pl: Proste kreskowanie liniowe

source: Diagonal line hatch
pl_pl: Ukośne kreskowanie liniowe

source: No Stroke-Width Render
pl_pl: Renderowanie bez szerokości obrysu

source: Ignore the stroke width when drawing the stroke
pl_pl: Ignoruj szerokość obrysu podczas rysowania obrysu

source: Show Variables
pl_pl: Pokaż zmienne

source: Replace variables in textboxes by their 'real' content
pl_pl: Zastąp zmienne w polach tekstowych ich 'rzeczywistą' zawartością

source: View
pl_pl: Widok

source: Sets/clears a magnet line on the scene
pl_pl: Ustawia/usuwa linię magnetyczną na scenie

source: Rounded Corners
pl_pl: Zaokrąglone narożniki

source: Ratio of X-Radius compared to width (in %)
pl_pl: Stosunek promienia X do szerokości (w %)

source: Enable Tone Curve
pl_pl: Włącz krzywą tonalną

source: Reset Tone Curve
pl_pl: Zresetuj krzywą tonalną

source: Tone Curve
pl_pl: Krzywa tonalna

source: Sharpen
pl_pl: Wyostrz

source: Sync to tree operations
pl_pl: Synchronizuj z operacjami drzewa

source: Keep order (as in tree)
pl_pl: Zachowaj kolejność (jak w drzewie)

source: Group by type (CCEERRII)
pl_pl: Grupuj według typu (CCEERRII)

source: Uncheck if you don't want automatic statistic generation
pl_pl: Odznacz, jeśli nie chcesz automatycznego generowania statystyk

source: Gathering information...
pl_pl: Gromadzenie informacji...

source: Burn-Time: {elapsed}, Remaining: {total}, {remaining}
pl_pl: Czas wypalania: {elapsed}, Pozostało: {total}, {remaining}

source: Job:...
pl_pl: Zadanie:...

source: Ignore outer areas
pl_pl: Ignoruj obszary zewnętrzne

source: Display simplified outline
pl_pl: Wyświetl uproszczony obrys

source: Show split line candidates
pl_pl: Pokaż kandydatów linii podziału

source: Break the image apart into slices
pl_pl: Rozbij obraz na plastry

source: Break the image apart but whiten non-used areas
pl_pl: Rozbij obraz, ale wybiel nieużywane obszary

source: identify inner white areas in image
pl_pl: identyfikuj wewnętrzne białe obszary w obrazie

source: Image white
pl_pl: Biel obrazu

source: Threshold for simplification
pl_pl: Próg uproszczenia

source: Do not invert the image
pl_pl: Nie odwracaj obrazu

source: Create minimum-area bounding rectangle instead of the contour
pl_pl: Utwórz prostokąt ograniczający o minimalnej powierzchni zamiast konturu

source: Swap X and Y
pl_pl: Zamień X i Y

source: move the laser at a specific speed and distance
pl_pl: przesuń laser z określoną prędkością i na określoną odległość

source: Set the driver speed.
pl_pl: Ustaw prędkość sterownika.

source: Connecting...
pl_pl: Łączenie...

source: Connection
pl_pl: Połączenie

source: Mock USB Connection Mode
pl_pl: Tryb połączenia Mock USB

source: DEBUG. Without a K40 connected continue to process things as if there was one.
pl_pl: DEBUG. Bez podłączonego K40 kontynuuj procesowanie rzeczy tak, jakby był podłączony.

source: Moshiboard-Controller
pl_pl: Kontroler Moshiboard

source: Sends Stop command
pl_pl: Wysyła polecenie Stop

source: Free Motor
pl_pl: Zwolnij silnik

source: Sends Free Motor (Unlock Rail) command
pl_pl: Wysyła polecenie Zwolnij silnik (Odblokuj szynę)
